Revit 2027 API
NumberingFormatSettings.MinimumNumberOfDigits Property
 Defines the minimum digit count for the numerical display.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int MinimumNumberOfDigits { get; set; }
Public Property MinimumNumberOfDigits As Integer
	Get
	Set
public:
property int MinimumNumberOfDigits {
	int get ();
	void set (int value);
}
member MinimumNumberOfDigits : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: minimumNumberOfDigits must be in range between 1 and 10.
Remarks
 This is not applied when numbering uses characters instead of digits.
See Also
Reference
NumberingFormatSettings Class
Autodesk.Revit.DB Namespace